# bookworm - полный базовый образ golang 1.25
FROM golang:1.25-bookworm

# указываем рабочую директори в контейнере
# так как внутри своя FS и она будет пустая
WORKDIR /app

# скопируй весь проект (первая .)
# в workdir контейнера (вторая .)
COPY . .

# установит все сторонние зависимости внутри нашего образа
RUN go mod tidy

# чтобы постоянно не собирать в бинарь проект
# с помощью go run cmd/users.go
# делаем 1 раз build, а далее исполняем
RUN go build -o /app/exe cmd/users.go

# команда запуска приложения
CMD ["/app/exe"]
